FemDesign.Reinforcement.Ptc.#ctor
Private constructor for serialization

FemDesign.Reinforcement.Ptc.#ctor(FemDesign.Bars.Bar,FemDesign.Reinforcement.PtcShapeType,FemDesign.Reinforcement.PtcLosses,FemDesign.Reinforcement.PtcManufacturingType,FemDesign.Reinforcement.PtcStrandLibType,FemDesign.Reinforcement.JackingSide,System.Double,System.Int32,System.String)
Construct post-tension cable
bar: Reference bar element
shape:
losses:
manufacturing:
strand:
numberOfStrands:
identifier:

FemDesign.Reinforcement.Ptc.#ctor(FemDesign.Shells.Slab,FemDesign.Geometry.LineSegment,FemDesign.Reinforcement.PtcShapeType,FemDesign.Reinforcement.PtcLosses,FemDesign.Reinforcement.PtcManufacturingType,FemDesign.Reinforcement.PtcStrandLibType,FemDesign.Reinforcement.JackingSide,System.Double,System.Int32,System.String)
Construct post-tension cable
slab: Reference slab element
line: Cable line
shape:
losses:
manufacturing:
strand:
numberOfStrands:
identifier: